Revit 2024 API
RevisionsOnSheetUIServiceData Properties
The RevisionsOnSheetUIServiceData type exposes the following members.
Properties
Name | Description
Document
 return the document
IsReset
 flag to indicate the value has been reset
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ParamId
 the parameter id
See Also
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace